Tekla.Structures.ModelInternal.dotRebarProperties_t
Struct for the RebarProperties.

Tekla.Structures.ModelInternal.dotRebarProperties_t.Size
The size.

Tekla.Structures.ModelInternal.dotRebarProperties_t.Grade
The grade.

Tekla.Structures.ModelInternal.dotRebarProperties_t.Name
The name.

Tekla.Structures.ModelInternal.dotRebarProperties_t.Class
The class.

Tekla.Structures.ModelInternal.dotRebarProperties_t.Finish
The finish.

Tekla.Structures.ModelInternal.dotRebarProperties_t.NumberingSeries
Defines the rebar numbering.

Tekla.Structures.ModelInternal.dotRebarProperties_t.BendingRadius
Defines the bending radius.

Tekla.Structures.ModelInternal.dotRebarProperties_t.StringSize
The string size.